<?php
/**
 * error status.
 * 1**：成功信息
 * 2**: 格式错误、非空等信息
 * 3**：验证错误信息(需读取数据库验证的)
 * 4**：其他错误信息
 * User: zxt
 * Date: 14-9-3
 * Time: 下午12:16
 */
return array(
    'reg' => array(
        '101' => '注册成功',
        '201' => '缺少必填参数',
        '202' => '手机号码不合法',
        '301' => '短信验证码错误',
        '302' => '验证码已失效',
        '303' => '该账户已经被注册',
        '401' => '未知错误'
    ),
    'login' => array(
        '101' => '登录成功',
        '201' => '缺少必填参数',
        '202' => '缺少设备IMEI信息',
        '203' => '手机号码不合法',
        '301' => '手机号码不存在或已冻结',
        '302' => '手机号码或密码错误',
        '303' => '此账户已冻结，请联系客服',
        '401' => '未知错误'
    ),
    'changePassword' => array(
        '101' => '修改成功',
        '201' => '缺少必填参数',
        '202' => '手机号码不合法',
        '301' => 'secret 认证错误',
        '302' => '手机号码不存在或已冻结',
        '303' => '原密码错误',
        '401' => '未知错误'
    ),
    'forgetPassword' => array(
        '101' => '修改成功',
        '201' => '缺少必填参数',
        '202' => '手机号码不合法',
        '301' => '验证码与手机号不匹配',
        '302' => '验证码已失效',
        '303' => '验证码不存在',
        '304' => '手机号码不存在或已冻结',
        '401' => '未知错误'
    ),
);